#!/usr/bin/env python3

# Плентимо бібліотеку/модуль sys для роботи з системними функціями
import sys

# Визначаємо набір слів
words = 'hello', 'python', 'world'

# Виводимо слова у термінал
print(' '.join(words))

# Створюємо змінну user зі значенням 'User'
user = 'User'

# Перевіряємо, чи було передано аргументи командного рядка
if len(sys.argv) > 1:
    # Якщо так, змінюємо значення змінної user на переданий аргумент
    user = sys.argv[1]

# Формуємо привітання з ім'ям, яке нам надав користувач
msg = f'Hello, {user}!'

# Друкуємо сформований рядок
print(msg)

# Lab1
